In [1]:
import pandas as pd
import numpy as np

In [17]:
df1 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo', 'foo'],
                    'value': [5, 6, 7, 8, 9]})

In [18]:
df1

  rkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [19]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8
4  foo      9

In [24]:
df1.merge(df2, on='rkey', how='inner')

  rkey  value_x  value_y
0  foo        1        5
1  foo        1        8
2  foo        1        9
3  foo        5        5
4  foo        5        8
5  foo        5        9
6  bar        2        6
7  baz        3        7